export const Data11Quiz = [
  {
    id: '①',
    quiz1: '12 × 2 = 24',
    quiz2: 24,
    quiz3: 12,
    quiz4: 2,
  },
  {
    id: '②',
    quiz1: '14 × 3 = 42',
    quiz2: 42,
    quiz3: 14,
    quiz4: 3,
  },
  {
    id: '③',
    quiz1: '12 × 5 = 60',
    quiz2: 60,
    quiz3: 12,
    quiz4: 5,
  },
];
export const Answer11 = [
  [2, 12],
  [3, 14],
  [5, 12],
];
export const Data12Quiz = [
  { id: '①', quiz1: '15 × 6' },
  { id: '②', quiz1: '4 × 19' },
  { id: '③', quiz1: '58 × 8' },
  { id: '④', quiz1: '48 × 6' },
];
//답에 또는이 있는 관계로 따로 처리 필요
export const Answer12 = [['90'], ['76'], ['464'], ['288']];

export const Data13Quiz = [
  {
    id: '①',
    quiz1: '42 ÷ 3 = 14',
    quiz2: '× 14 = 42',
  },
  {
    id: '②',
    quiz1: '48 ÷ 2 = 24',
    quiz2: '× 24 = 48',
  },
  {
    id: '③',
    quiz1: '99 ÷ 9 = 11',
    quiz2: '× 11 = 99',
  },
];
export const Answer13 = [[3], [2], [9]];
export const Data14Quiz = [
  { id: '①', quiz1: '85 ÷ 5' },
  { id: '②', quiz1: '98 ÷ 7' },
  { id: '③', quiz1: '116 ÷ 4' },
  { id: '④', quiz1: '68 ÷ 4' },
];
export const Answer14 = [
  ['17', '85', '15'],
  ['14', '98', '7'],
  ['29', '116', '4'],
  ['17', '68', '4'],
];
export const Data21Quiz = [
  {
    id: '①',
    quiz1: '14',
    quiz2: '32',
    quiz3: '8',
    quiz4: '56',
    quiz5: '7',
    quiz6: '',
    quiz7: '',
    quiz8: '',
  },
  {
    id: '②',
    quiz1: '10',
    quiz2: '48',
    quiz3: '15',
    quiz4: '32',
    quiz5: '',
    quiz6: '5',
    quiz7: '',
    quiz8: '',
  },
  {
    id: '③',
    quiz1: '28',
    quiz2: '34',
    quiz3: '14',
    quiz4: '68',
    quiz5: '',
    quiz6: '',
    quiz7: '2',
    quiz8: '',
  },
  {
    id: '④',
    quiz1: '55',
    quiz2: '18',
    quiz3: '22',
    quiz4: '45',
    quiz5: '',
    quiz6: '',
    quiz7: '',
    quiz8: '9',
  },
];
export const Answer21 = [
  [null, 8, 2, 4],
  [2, 16, null, 3],
  [4, 17, 7, null],
  [5, null, 9, 11, 2],
];
export const Data22Quiz = [
  { id: '①', quiz1: '35', quiz2: '81', quiz3: '63', quiz4: '45' },
  { id: '②', quiz1: '24', quiz2: '14', quiz3: '16', quiz4: '21' },
  { id: '③', quiz1: '10', quiz2: '40', quiz3: '25', quiz4: '16' },
  { id: '④', quiz1: '26', quiz2: '27', quiz3: '18', quiz4: '39' },
  { id: '⑤', quiz1: '56', quiz2: '15', quiz3: '35', quiz4: '24' },
  { id: '⑥', quiz1: '21', quiz2: '60', quiz3: '36', quiz4: '35' },
];
export const Answer22 = [
  [5, 9, 7, 9],
  [3, 7, 8, 2],
  [2, 8, 5, 5],
  [13, 3, 2, 9],
  [8, 3, 7, 5],
  [7, 5, 3, 12],
];
export const Data31Quiz = [
  { id: '①', quiz1: '54 ÷ 9 = 6 ' },
  { id: '②', quiz1: '25 ÷ 5 = 5' },
  { id: '③', quiz1: '24 ÷ 8 = 3' },
  { id: '④', quiz1: '35 ÷ 5 = 7' },
];
export const Answer31 = [
  [9, 6, 54],
  [5, 5, 25],
  [8, 3, 24],
  [5, 7, 35],
];

export const Data32Quiz = [
  { id: '①', quiz1: '24 ÷ 6' },
  { id: '②', quiz1: '48 ÷ 8' },
  { id: '③', quiz1: '30 ÷ 5' },
  { id: '④', quiz1: '27 ÷ 9' },
  { id: '⑤', quiz1: '60 ÷ 6' },
  { id: '⑥', quiz1: '15 ÷ 3' },
  { id: '⑦', quiz1: '49 ÷ 7' },
  { id: '⑧', quiz1: '28 ÷ 4' },
];
export const Answer32 = [
  [4, 6, 4, 24],
  [6, 8, 6, 48],
  [6, 5, 6, 30],
  [3, 9, 3, 27],
  [10, 6, 6, 60],
  [5, 3, 5, 15],
  [7, 7, 7, 49],
  [7, 4, 7, 28],
];

export const Data33Quiz = [
  { id: '①', quiz1: '72 ÷ 9' },
  { id: '②', quiz1: '40 ÷ 8' },
  { id: '③', quiz1: '70 ÷ 7' },
  { id: '④', quiz1: '55 ÷ 5' },
  { id: '⑤', quiz1: '24 ÷ 4' },
  { id: '⑥', quiz1: '48 ÷ 4' },
  { id: '⑦', quiz1: '18 ÷ 9' },
  { id: '⑧', quiz1: '36 ÷ 6' },
];
export const Answer33 = [
  [8, 9, 8, 272],
  [5, 8, 5, 40],
  [10, 7, 10, 70],
  [11, 5, 11, 55],
  [6, 4, 6, 24],
  [12, 4, 12, 48],
  [2, 9, 2, 18],
  [6, 6, 6, 36],
];

export const Data41Quiz = [
  { id: '①', quiz1: '38 ÷ 4 = 9 ··· 2' },
  { id: '②', quiz1: '29 ÷ 5 = 5 ··· 4' },
  { id: '③', quiz1: '50 ÷ 6 = 8 ··· 2' },
  { id: '④', quiz1: '31 ÷ 9 = 3 ··· 4' },
];
export const Answer41 = [
  [4, 9, 2, 38],
  [5, 5, 4, 29],
  [6, 8, 2, 50],
  [9, 3, 4, 31],
];

export const Data42Quiz = [
  { id: '①', quiz1: '77 ÷ 4' },
  { id: '②', quiz1: '86 ÷ 6' },
  { id: '③', quiz1: '76 ÷ 3' },
  { id: '④', quiz1: '95 ÷ 7' },
  { id: '⑤', quiz1: '63 ÷ 5' },
  { id: '⑥', quiz1: '43 ÷ 2' },
  { id: '⑦', quiz1: '99 ÷ 8' },
  { id: '⑧', quiz1: '58 ÷ 4' },
];
export const Answer42 = [
  [19, 1, 4, 19, 1, 77],
  [14, 2, 6, 14, 2, 86],
  [25, 1, 3, 25, 1, 76],
  [13, 4, 7, 13, 4, 95],
  [12, 3, 5, 12, 3, 63],
  [21, 1, 2, 21, 1, 43],
  [12, 3, 8, 12, 3, 99],
  [14, 2, 4, 14, 2, 58],
];

export const Data43Quiz = [
  { id: '①', quiz1: '63 ÷ 5' },
  { id: '②', quiz1: '97 ÷ 4' },
  { id: '③', quiz1: '89 ÷ 6' },
  { id: '④', quiz1: '52 ÷ 3' },
  { id: '⑤', quiz1: '94 ÷ 5' },
  { id: '⑥', quiz1: '86 ÷ 7' },
  { id: '⑦', quiz1: '74 ÷ 4' },
  { id: '⑧', quiz1: '47 ÷ 3' },
];
export const Answer43 = [
  [12, 3, 5, 12, 3, 63],
  [24, 1, 4, 24, 1, 97],
  [14, 5, 6, 14, 5, 89],
  [17, 1, 3, 17, 1, 52],
  [18, 4, 5, 18, 4, 94],
  [12, 2, 7, 12, 2, 86],
  [18, 2, 4, 18, 74],
  [15, 2, 3, 15, 2, 47],
];

export const Data51Quiz = [
  {
    id: '①',
    quiz1:
      '연필꽂이에 있는 연필은 각각 몇 자루인지 나눗셈식으로 나타내 보세요.',
    sign1: '×',
  },
  {
    id: '②',
    quiz1: '연필꽂이는 모두 몇 개인지 나눗셈식으로 나타내 보세요.',
    sign1: '÷',
  },
];
export const Answer51 = [
  [84, 7, 12],
  [84, 12, 7],
];

export const Data52Quiz1 = [
  {
    id: '①',
    quiz1: ' 체육 대회에 참가하는 조는 몇 개인지 나눗셈식으로 나타내 보세요.',
    sign1: '÷',
  },
  {
    id: '②',
    quiz1: '민규네 학교 남학생은 모두 몇 명인지 곱셈식으로 나타내 보세요.',
    sign1: '×',
  },
];

export const Data52Quiz2 = [
  {
    id: '①',
    quiz1: '상자 하나에 담은 탁구공은 몇 개인지 나눗셈식으로 나타내 보세요.',
    sign1: '÷',
  },
  {
    id: '②',
    quiz1: ' 탁구공은 모두 몇 개인지 곱셈식으로 나타내 보세요.',
    sign1: '×',
  },
];
export const Answer52 = [
  [96, 8, 12],
  [8, 12, 96],
  [144, 9, 16],
  [9, 16, 144],
];

export const Data53Quiz = [
  {
    id: '①',
    quiz1:
      '민수는 할머니 댁의 오이 농장에서 91개의 오이를 따서 7개의 바구니에 똑같이 담았습니다. \n 바구니 하나에 담긴 오이는 몇 개일까요?',
  },
  {
    id: '②',
    quiz1:
      '성혁이는 빨간색, 파란색, 노란색, 흰색 풍선을 같은 개수로 샀더니 모두 148개가 되었습니다. 이 중 흰색 풍선은 몇 개일까요?',
  },
  {
    id: '③',
    quiz1:
      '길이가 279 cm인 테이프를 9 cm씩 잘라 나갔습니다. 테이프를 더 이상 자를 수 없을 때까지 잘랐다면 잘린 테이프는 모두 몇 개일까요?',
  },
  {
    id: '④',
    quiz1:
      '꽃집에서 장미꽃 90송이를 똑같이 나누어 6다발로 만들어 팔고 있습니다. 한 다발에는 장미꽃 몇 송이가 들어 있을까요?',
  },
];
export const Answer53 = [[13], [37], [31], [15]];
