export const Data11Quiz = [
  { id: '①', quiz1: 6000 },
  { id: '②', quiz1: 8800 },
  { id: '③', quiz1: 4000 },
  { id: '④', quiz1: 9900 },
];
export const Answer11 = [[4000], [1200], [6000], [100]];
export const Data12Quiz = [
  { id: '①' },
  { id: '②' },
  { id: '③' },
  { id: '④' },
  { id: '⑤' },
  { id: '⑥' },
];
export const Answer12 = [[40000], [20000], [60000], [60000], [50000], [20000]];

export const Data13Quiz = [
  { id: '①', quiz1: '10000은 1000의', quiz2: '배 입니다.' },
  { id: '②', quiz1: '10000이 3개인 수는', quiz2: '입니다.' },
  { id: '③', quiz1: '오만은', quiz2: '이라 씁니다.' },
  { id: '④', quiz1: '9500은 10000보다', quiz2: '작은 수입니다.' },
  { id: '⑤', quiz1: '70000은 10000이', quiz2: '개인 수입니다.' },
  { id: '⑥', quiz1: '9990은 10000보다', quiz2: '작은 수입니다.' },
  { id: '⑦', quiz1: '50000은 10000의', quiz2: '배 입니다.' },
  { id: '⑧', quiz1: '1000이 80개인 수는', quiz2: '입니다.' },
  { id: '⑨', quiz1: '', quiz2: '은 칠만이라고 읽습니다.' },
];
export const Answer13 = [
  [10],
  [30000],
  [50000],
  [500],
  [7],
  [10],
  [5],
  [80000],
  [70000],
];

export const Data21Quiz = [{ id: '①' }, { id: '②' }, { id: '③' }];
export const Answer21 = [
  [10000, 4000, 600, 20, 3, 14623],
  [30000, 2000, 300, 50, 6, 32356],
  [20000, 3000, 400, 50, 5, 23455],
];

export const Data22Quiz = [
  {
    id: '①',
    type: 1,
    quiz1: 29548,
  },
  {
    id: '②',
    type: 2,
    quiz1: 5,
    quiz2: 7,
    quiz3: 4,
    quiz4: 1,
    quiz5: 8,
  },
  {
    id: '③',
    type: 1,
    quiz1: 86347,
  },
  {
    id: '④',
    type: 2,
    quiz1: 1,
    quiz2: 9,
    quiz3: 3,
    quiz4: 4,
    quiz5: 4,
  },
  {
    id: '⑤',
    type: 1,
    quiz1: 36934,
  },
];
export const Answer22 = [
  [2, 9, 5, 4, 8],
  [57418],
  [8, 6, 3, 4, 7],
  [19344],
  [3, 6, 9, 3, 4],
];

export const Data23Quiz = [
  {
    id: '①',
    quiz1: '30000',
    quiz2: '40000',
    quiz3: '50000',
    quiz4: '60000',
    quiz5: '',
    quiz6: '',
    quiz7: '90000',
  },
  {
    id: '②',
    quiz1: '25463',
    quiz2: '35463',
    quiz3: '45463',
    quiz4: '',
    quiz5: '65463',
    quiz6: '',
    quiz7: '85463',
  },
  {
    id: '③',
    quiz1: '46500',
    quiz2: '47500',
    quiz3: '48500',
    quiz4: '',
    quiz5: '',
    quiz6: '51500',
    quiz7: '',
  },
  {
    id: '④',
    quiz1: '19996',
    quiz2: '19997',
    quiz3: '19998',
    quiz4: '',
    quiz5: '',
    quiz6: '',
    quiz7: '',
  },
  {
    id: '⑤',
    quiz1: '',
    quiz2: '35000',
    quiz3: '',
    quiz4: '',
    quiz5: '65000',
    quiz6: '75000',
    quiz7: '85000',
  },
  {
    id: '⑥',
    quiz1: '',
    quiz2: '',
    quiz3: '76410',
    quiz4: '',
    quiz5: '76430',
    quiz6: '76440',
    quiz7: '76450',
  },
  {
    id: '⑦',
    quiz1: '',
    quiz2: '93045',
    quiz3: '',
    quiz4: '',
    quiz5: '93345',
    quiz6: '93445',
    quiz7: '93545',
  },
  {
    id: '⑧',
    quiz1: '',
    quiz2: '',
    quiz3: '',
    quiz4: '',
    quiz5: '18541',
    quiz6: '18542',
    quiz7: '18543',
  },
];
export const Answer23 = [
  [null, null, null, null, 70000, 80000, null],
  [null, null, null, 55463, null, 75463, null],
  [null, null, null, 49500, 50500, null, 52500],
  [null, null, null, 19999, 20000, 20001, 20002],
  [25000, null, 45000, 55000, null, null, null],
  [76390, 76400, null, 76420, null, null, null],
  [92945, null, 93145, 93245, null, null, null],
  [18537, 18538, 18539, 18540, null, null, null],
];

export const Data31Quiz = [
  { id: '①', type: 1, quiz1: '30만의 10배는' },
  { id: '②', type: 2, quiz1: '100' },
  { id: '③', type: 1, quiz1: '200만의 10배는' },
  { id: '④', type: 2, quiz1: '1000' },
  { id: '⑤', type: 1, quiz1: '1만의 1000배는' },
];
export const Answer31 = [
  ['300만'],
  ['100만'],
  ['2000만'],
  ['100만'],
  ['1000만'],
];

export const Data32Quiz = [
  { id: '①', type: 1, quiz1: '4만', quiz2: '40만' },
  { id: '②', type: 2, quiz1: '9만', quiz2: '1000' },
  { id: '③', type: 1, quiz1: '4만', quiz2: '4000만' },
  { id: '④', type: 2, quiz1: '70만', quiz2: '100' },
  { id: '⑤', type: 1, quiz1: '20만', quiz2: '2000만' },
  { id: '⑥', type: 2, quiz1: '500만', quiz2: '10' },
  { id: '⑦', type: 1, quiz1: '800만', quiz2: '8000만' },
  { id: '⑧', type: 2, quiz1: '200만', quiz2: '10' },
];
export const Answer32 = [
  ['10'],
  ['9000만'],
  ['1000'],
  ['7000만'],
  ['100'],
  ['5000만'],
  ['10'],
  ['2000만'],
];

export const Data33Quiz = [
  { id: '①' },
  { id: '②' },
  { id: '③' },
  { id: '④' },
  { id: '⑤' },
  { id: '⑥' },
  { id: '⑦' },
];
export const Answer33 = [
  [300000, 30, 10000],
  [70000, 70, 1000],
  [700000, 7000, 100],
  [500000, 500, 1000],
  [100000, 100, 1000],
  [900000, 90, 10000],
  [80000, 80, 1000],
];

export const Data41Quiz = [
  { id: '①', quiz1: 5365471, quiz2: 2967741, quiz3: 4795934, quiz4: 837652 },
  { id: '②', quiz1: 534791, quiz2: 539259, quiz3: 536537, quiz4: 530491 },
  { id: '③', quiz1: 971591, quiz2: 3456723, quiz3: 1911753, quiz4: 3457921 },
  { id: '④', quiz1: 53457, quiz2: 255841, quiz3: 365781, quiz4: 53472 },
  { id: '⑤', quiz1: 974532, quiz2: 974517, quiz3: 367512, quiz4: 69751 },
  { id: '⑥', quiz1: 785491, quiz2: 658751, quiz3: 433257, quiz4: 795142 },
  { id: '⑦', quiz1: 295414, quiz2: 754264, quiz3: 754642, quiz4: 295427 },
];
export const Answer41 = [
  [1, 4],
  [2, 4],
  [4, 1],
  [3, 1],
  [1, 4],
  [4, 3],
  [3, 1],
];

export const Data42Quiz = [
  { id: '①' },
  { id: '②' },
  { id: '③' },
  { id: '④' },
  { id: '⑤' },
];
export const Answer42 = [
  [300, 70, 6000, 5, 6000],
  [30000, 600, 9000, 6000, 30000],
  [4000, 300, 90, 30, 4000],
  [5000, 900, 50, 70000, 70000],
  [10000, 6000, 1000, 40, 10000],
];

export const Data43Quiz = [
  { id: '①', quiz1: '4만', quiz2: '3510의 10배' },
  { id: '②', quiz1: '47의 100배', quiz2: '4750' },
  { id: '③', quiz1: '9만', quiz2: '9500의 10배' },
  { id: '④', quiz1: '281의 10배', quiz2: '2850' },
  { id: '⑤', quiz1: '3611', quiz2: '35의 100배' },
  { id: '⑥', quiz1: '10만', quiz2: '950의 100배' },
  { id: '⑦', quiz1: '75300', quiz2: '7500의 10배' },
  { id: '⑧', quiz1: '373의 100배', quiz2: '37400' },
  { id: '⑨', quiz1: '17의 1000배', quiz2: '2만' },
  { id: '⑩', quiz1: '781의 100배', quiz2: '8만' },
];

export const Answer43 = [
  ['>'],
  ['<'],
  ['<'],
  ['<'],
  ['>'],
  ['>'],
  ['>'],
  ['<'],
  ['<'],
  ['<'],
];

export const Data51Quiz = [
  {
    id: '①',
    quiz1:
      '  만 원짜리 지폐 100장을 겹치는 부분 없이 한 줄로 이은 길이를 구하세요.',
    unit: 'mm',
  },
];
export const Answer51 = [[148, 14800, 100, 14800]];

export const Data52Quiz = [
  {
    id: '①',
    quiz1:
      '동해시의 인구는 92000명이고 성남시의 인구는 동해시의 10배입니다. 성남시의 인구는 몇 명인가요?',
    unit: '명',
  },
  {
    id: '②',
    quiz1:
      '어떤 공장에서 장난감을 매일 41만 개씩 만듭니다. 이 공장에서 100일 동안 만든 장난감은 몇 개인가요?',
    unit: '개',
  },
  {
    id: '③',
    quiz1:
      '가람이는 한 걸음에 51 cm씩 걷습니다. 가람이가 천 걸음 걸으면 몇 cm를 걷나요?',
    unit: 'cm',
  },
  {
    id: '④',
    quiz1: '사탕 한 개에 320원입니다. 사탕 1000개의 가격은 얼마인가요?',
    unit: '원',
  },
];
export const Answer52 = [
  ['92000', '920000', '10', '920000'],
  ['410000', '41000000', '100', '41000000'],
  ['51', '51000', '1000', '51000'],
  ['320', '320000', '1000', '320000'],
];

export const Data53Quiz = [
  {
    id: '①',
    quiz1:
      '한 상자에 성냥개비가 40개씩 들어 있습니다. 상자 천 개에 들어 있는 성냥개비는 몇 개인가요?',
    unit: '개',
  },
  {
    id: '②',
    quiz1:
      '5만 원짜리 지폐 천 장으로 자동차를 샀습니다. 자동차의 가격은 얼마인가요?',
    unit: '원',
  },
  {
    id: '③',
    quiz1:
      '지우개 1개의 높이는 12 mm입니다. 지우개 100개를 한 줄로 쌓은 높이는 몇 mm인가요?',
    unit: 'mm',
  },
  {
    id: '④',
    quiz1:
      '빛은 1초에 30만 km를 갑니다. 빛이 100초 동안 가는 거리는 몇 km인가요?',
    unit: 'km',
  },
];
export const Answer53 = [
  ['40', '40000', '1000', '40000'],
  ['5만', '5000만', '1000', '5000만'],
  ['12', '1200', '100', '1200'],
  ['30만', '3000만', '100', '3000만'],
];
